In [109]:
import pandas as pd
import numpy as np

In [110]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [111]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [112]:
l = df[df['FlightNumber'].isnull()].index.tolist()

In [113]:
df.FlightNumber.fillna(method='ffill',inplace = True)

In [114]:
for i in range(len(l)) :
    df.iloc[l[i],1] = df.iloc[l[i],1] + 10

In [115]:
 
 df1 = df
 df1[['From','To']] = df1.From_To.str.split("_",expand=True)

In [116]:
df1.drop(['From_To'], axis = 1,inplace =True)

In [119]:
df1['From'] = df1['From'].str.capitalize()
df1['To'] = df1['To'].str.capitalize()

In [120]:
df1

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1       10055.0            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3       10075.0          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

In [122]:
df1['RecentDelays']

0        [23, 47]
1              []
2    [24, 43, 87]
3            [13]
4        [67, 32]
Name: RecentDelays, dtype: object

In [126]:
df2 = pd.DataFrame(df1["RecentDelays"].to_list(),columns =['Delay1','Delay2','Delay3'])

In [129]:
df1['Delay1'],df1['Delay2'],df1['Delay3'] = df2['Delay1'],df2['Delay2'],df2['Delay3']

In [135]:
df1.rename(columns={'RecentDelays': 'Delays'}, inplace=True)

In [136]:
df1

,FlightNumber,Delays,Airline,From,To,Delay1,Delay2,Delay3
0,10045.0,"[23, 47]",KLM(!),London,Paris,23.0,47.0,NaN
1,10055.0,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075.0,[13],12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085.0,"[67, 32]","""Swiss Air""",Brussels,London,67.0,32.0,NaN